tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "shopify/shopify"
brew "awscli"
brew "cask"
brew "fdupes"
brew "gh"
brew "git"
brew "htop"
brew "jq"
brew "nmap"
brew "pv"
brew "rclone"
brew "speedtest-cli"
brew "thefuck"
brew "watch"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "shopify/shopify/shopify-cli"
cask "1password"
cask "bartender"
cask "cardhop"
cask "chatgpt"
cask "creality-slicer"
cask "discord"
cask "dropbox"
cask "fantastical"
cask "figma"
cask "github"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "kaleidoscope"
cask "kindle"
cask "messenger"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "mimestream"
cask "monitorcontrol"
cask "nordvpn"
cask "notion"
cask "notion-calendar"
cask "onedrive"
cask "raspberry-pi-imager"
cask "rectangle"
cask "signal"
cask "slack"
cask "spotify"
cask "stats"
cask "telegram"
cask "transmit"
cask "ultimaker-cura"
cask "viber"
cask "visual-studio-code"
cask "warp"
cask "whatsapp"
cask "zoom"
vscode "davidanson.vscode-markdownlint"
vscode "editorconfig.editorconfig"
vscode "foxundermoon.shell-format"
vscode "github.vscode-github-actions"
vscode "kaiwood.endwise"
vscode "lorankloeze.ruby-rubocop-revived"
vscode "ms-vscode-remote.remote-containers"
vscode "rebornix.ruby"
vscode "sorbet.sorbet-vscode-extension"
vscode "timonwong.shellcheck"
vscode "wingrunr21.vscode-ruby"
