tap "buo/cask-upgrade"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "shopify/shopify"
# Official Amazon AWS command-line interface
brew "awscli"
# Emacs dependency management
brew "cask"
# Identify or delete duplicate files
brew "fdupes"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Port scanning utility for large networks
brew "nmap"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Monitor data's progress through a pipe
brew "pv"
# Rsync for cloud storage
brew "rclone"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Programmatically correct mistyped console commands
brew "thefuck"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# WordPress security scanner
brew "wpscan"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A CLI tool to build for the Shopify platform
brew "shopify/shopify/shopify-cli"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Menu bar icon organiser
cask "bartender"
# Contacts manager
cask "cardhop"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Slicer for all Creality FDM 3D printers
cask "creality-slicer"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Calendar software
cask "fantastical"
# Collaborative team software
cask "figma"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Client for the Google Drive storage service
cask "google-drive"
# Grammarly for desktop
cask "grammarly-desktop"
# Spot and merge differences in text and image files or folders
cask "kaleidoscope"
# Interface for reading and syncing eBooks
cask "kindle"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Spreadsheet software
cask "microsoft-excel"
# Email client
cask "microsoft-outlook"
# Presentation software
cask "microsoft-powerpoint"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Word processor
cask "microsoft-word"
# Native app email client for Gmail
cask "mimestream"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Cloud storage client
cask "onedrive"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Messaging app with a focus on speed and security
cask "telegram"
# File transfer application
cask "transmit"
# 3D printer and slicing GUI
cask "ultimaker-cura"
# Calling and messaging application focusing on security
cask "viber"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "AwardWallet", id: 1473828829
mas "Awesome Screenshot & Recorder", id: 1531282066
mas "CardPointers", id: 1472875808
mas "Grammarly for Safari", id: 1462114288
mas "Notion Web Clipper", id: 1559269364
mas "PayPal Honey", id: 1472777122
mas "Wayback Machine", id: 1472432422
vscode "charliermarsh.ruff"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "zainchen.json"
